---
kind: property
id: P:Autodesk.Revit.DB.GroupTypeId.EnergyAnalysis
source: html/477b8aad-b152-5f3c-372c-8a1d4da43ac6.htm
---
# Autodesk.Revit.DB.GroupTypeId.EnergyAnalysis Property

Energy Analysis.

## Syntax (C#)
```csharp
public static ForgeTypeId EnergyAnalysis { get; }
```